#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-AxPskfSUTWLDjW8A

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=ca06cffc-e8d5-4850-9c9c-970e196a1fc4]
data.digitalocean_kubernetes_cluster.openarabic: Reading...
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 1s [id=ca06cffc-e8d5-4850-9c9c-970e196a1fc4]
helm_release.metrics-server: Refreshing state... [id=metrics-server]
kubernetes_namespace.openarabic: Refreshing state... [id=openarabic]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_container_registry.repository will be created
  + resource "digitalocean_container_registry" "repository" {
      + created_at             = (known after apply)
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + name                   = "repository"
      + region                 = (known after apply)
      + server_url             = (known after apply)
      + storage_usage_bytes    = (known after apply)
      + subscription_tier_slug = "starter"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*